/*****************************************************************************/
/*                                                                           */
/*              Ittiam 802.11 MAC HARDWARE UNIT TEST CODE                    */
/*                                                                           */
/*                  ITTIAM SYSTEMS PVT LTD, BANGALORE                        */
/*                           COPYRIGHT(C) 2005                               */
/*                                                                           */
/*  This program  is  proprietary to  Ittiam  Systems  Private  Limited  and */
/*  is protected under Indian  Copyright Law as an unpublished work. Its use */
/*  and  disclosure  is  limited by  the terms  and  conditions of a license */
/*  agreement. It may not be copied or otherwise  reproduced or disclosed to */
/*  persons outside the licensee's organization except in accordance with the*/
/*  terms  and  conditions   of  such  an  agreement.  All  copies  and      */
/*  reproductions shall be the property of Ittiam Systems Private Limited and*/
/*  must bear this notice in its entirety.                                   */
/*                                                                           */
/*****************************************************************************/

/*****************************************************************************/
/*                                                                           */
/*  File Name         : mh_test.h                                            */
/*                                                                           */
/*  Description       : This file contains all declarations and functions    */
/*                      related to the H/w unit test.                        */
/*                                                                           */
/*  List of Functions : None                                                 */
/*  Issues / Problems : None                                                 */
/*                                                                           */
/*****************************************************************************/

#ifdef MAC_HW_UNIT_TEST_MODE

#ifndef MH_TEST_H
#define MH_TEST_H

/*****************************************************************************/
/* File Includes                                                             */
/*****************************************************************************/

#include "common.h"
#include "imem_if.h"
#include "mh_test_config.h"
#include "proc_if.h"
#include "qmu_if.h"
#include "transmit.h"
#include "receive.h"
#include "prot_if.h"
#include "mh_test_utils.h"

#ifdef MAC_802_11I
#include "rsna_km.h"
#endif /* MAC_802_11I */

/* ITM-DEBUG */
#include "phy_prot_if.h"

#ifdef TX_ABORT_FEATURE
#ifdef TEST_TX_ABORT_FEATURE
#include "mh_test_txabort.h"
#endif /* TEST_TX_ABORT_FEATURE */
#endif /* TX_ABORT_FEATURE */

/*****************************************************************************/
/* Constants                                                                 */
/*****************************************************************************/

#define MAX_RX_BUFF_COUNT   20
#define INITFCS32           0xFFFFFFFF
#define INIT_TX_SEQNO       1
#define NUM_NONHT_LONG_SHORT_RATES  15
#define NUM_NON_HT_RATES            NUM_NONHT_LONG_SHORT_RATES
#define NUM_HT_RATES        32
#define MIN_TX_BUFFER_LEN   1500
#define TOTAL_RATES         (NUM_NON_HT_RATES + 32)

/* Constants for Variable Per Packet Parameter feature */
#define NUM_VALID_FRAME_FMT          18
#define MAX_VPPP_TX_FRAME_LEN        1500
#define MIN_VPPP_TX_FRAME_LEN        31
#define VARY_PARAM_ROUND_ROBIN       0
#define VARY_PARAM_RANDOM            1
#define VPPP_SHORT_GI_ENABLE_BIT     BIT6

/*****************************************************************************/
/* Structures                                                                */
/*****************************************************************************/

typedef struct
{
    /* PHY data rate structure */
    struct
    {
        UWORD32 dr1_l;  /* Long 1    */
        UWORD32 dr2_l;  /* Long 2    */
        UWORD32 dr5_l;  /* Long 5.5  */
        UWORD32 dr11_l; /* Long 11   */
        UWORD32 dr2_s;  /* Short 2   */
        UWORD32 dr5_s;  /* Short 5.5 */
        UWORD32 dr11_s; /* Short 11  */
        UWORD32 dr6;    /* 6         */
        UWORD32 dr9;    /* 9         */
        UWORD32 dr12;   /* 12        */
        UWORD32 dr18;   /* 18        */
        UWORD32 dr24;   /* 24        */
        UWORD32 dr36;   /* 36        */
        UWORD32 dr48;   /* 48        */
        UWORD32 dr54;   /* 54        */
        UWORD32 drht;   /* HT Rates  */
        UWORD32 dr0;    /* Reserved  */
    } phy_dr;

    /* Receive status structure */
    struct
    {
        UWORD32 irx0;        /* Invalid                     */
        UWORD32 irxf;        /* FCS failure                 */
        UWORD32 irxs;        /* Rx Successful               */
        UWORD32 irxd;        /* Duplicate Detected          */
        UWORD32 irxmf;       /* MIC failed                  */
        UWORD32 irxkf;       /* Key failed                  */
        UWORD32 irxicvf;     /* ICV failed                  */
        UWORD32 irxtkipicvf; /* ICV failed for TKIP         */
        UWORD32 irxtkipmf;   /* MIC failed for TKIP         */
        UWORD32 irxrf;       /* CCMP Replay Failure         */
        UWORD32 irxtkiprf;   /* TKIP Replay Failure         */
        UWORD32 irxdip;      /* Defragmentation in Progress */
        UWORD32 irxdf;       /* Defragmentation Failure     */
        UWORD32 irxEX;       /* Exception - Reserved value  */
    } st;

    /* Receive cipher type structure */
    struct
    {
        UWORD32 wep40;    /* WEP-40 encrypted  */
        UWORD32 wep104;   /* WEP-104 encrypted */
        UWORD32 tkip;     /* TKIP encrypted    */
        UWORD32 ccmp;     /* CCMP encrypted    */
        UWORD32 unencryp; /* Not encrypted     */
        UWORD32 ukencryp; /* Unknown encryption */
    } cip_type;

    /* MAC data rate structure */
    struct
    {
        UWORD32 dr1_l[2];  /* Long 1    */
        UWORD32 dr2_l[2];  /* Long 2    */
        UWORD32 dr5_l[2];  /* Long 5.5  */
        UWORD32 dr11_l[2]; /* Long 11   */
        UWORD32 dr2_s[2];  /* Short 2   */
        UWORD32 dr5_s[2];  /* Short 5.5 */
        UWORD32 dr11_s[2]; /* Short 11  */
        UWORD32 dr6[2];    /* 6         */
        UWORD32 dr9[2];    /* 9         */
        UWORD32 dr12[2];   /* 12        */
        UWORD32 dr18[2];   /* 18        */
        UWORD32 dr24[2];   /* 24        */
        UWORD32 dr36[2];   /* 36        */
        UWORD32 dr48[2];   /* 48        */
        UWORD32 dr54[2];   /* 54        */
        UWORD32 dr0[2];    /* Unknown   */
        UWORD32 mcs[MAX_MCS_SUPPORTED+1][2];
    } dr;

    /* MAC frame type structure */
    struct
    {
        UWORD32 bcn;            /* Beacon                 */
        UWORD32 rts;            /* RTS                    */
        UWORD32 cts;            /* CTS                    */
        UWORD32 ack;            /* ACK                    */
        UWORD32 probersp;       /* Probe response         */
        UWORD32 probereq;       /* Probe request          */
        UWORD32 atim;           /* ATIM                   */
        UWORD32 cfend;          /* CF-End                 */
        UWORD32 back;           /* Block-Ack              */
        UWORD32 bar;            /* Block-Ack Request      */
        UWORD32 mc_data;        /* Multicast data         */
        UWORD32 uc_data;        /* Unicast data           */
        UWORD32 oth_data;       /* Other data             */
